export default [
  {
    mode: 'A',
    name: '貪得無厭型',
    header: '『別人的東西就是我的東西』，主張個人權利',
    message: [
      '理想目標是『他人理當為我奉獻付出』',
      '在付出與獲得之間，更看重『獲得』，對自己的利害關係很敏感，也對金錢、物質或他人的關注非常執著，任何事都傾向以利弊得失來判斷',
      '對他人有所期待，但對方如果辜負了自己的期待，就會生氣',
    ],
  },
  {
    mode: 'B',
    name: '嬰兒型',
    header: '察顏觀色，力求討人喜愛的依賴型',
    message: [
      '理想目標是『希望別人保護我』，也就是撒嬌型的人',
      '懂得顯露自己脆弱的一面，以博得他人的協助與保護',
      '很少自己積極主動進行某些事，有依賴他人、迴避人生課題的傾向。同時希望自己能獲得他人特別的對待',
    ],
  },
  {
    mode: 'C',
    name: '拼命三郎型',
    header: '不假手他人，不顧一切橫衝直撞',
    message: [
      '理想目標是『我必須表現優異』，是朝著自己定下的理想或目標份力前進、努力不懈的人',
      '但由於總是想當第一名、成為中心人物，所以很難結交夥伴',
      '此外，由於有支配他人的意圖，有時會變得具攻擊性',
    ],
  },
  {
    mode: 'D',
    name: '自我壓抑型',
    header: '不讓情感外露的完美主義者',
    message: [
      '理想目標是『我絕不能失敗』',
      '在他人眼中是不太會顯露情感、冷靜自持的人；守時、有追求完美的傾向，也有固執難以溝通的部分',
      '由於不輕易表露自己的情感，有時會拼命壓抑情緒',
    ],
  },
  {
    mode: 'E',
    name: '好奇嘗鮮型',
    header: '只要覺得好，就馬上行動，但容易虎頭蛇尾',
    message: [
      '理想目標是『隨時隨地都要覺得開心』',
      '好奇心十分旺盛，喜歡各種慶典，偶爾會故意冒險，或因分寸拿捏不好而犯規',
      '不過只有剛開始會充滿幹勁，途中就會因為厭煩而興趣缺缺，或是讓周遭變得一團混亂',
    ],
  },
  {
    mode: 'F',
    name: '安逸型',
    header: '無法察覺身邊其他人的想法，只求安逸舒適',
    message: [
      '理想目標是『想輕鬆一點』',
      '雖然身邊的人都認為，他只要再認真點，就能發揮更多實力，替他乾著急，但本人卻一點也不在意，堅持貫徹自我主張',
      '不想做麻煩和辛苦的事、不想承擔重責大任，表現也不太突出',
      '自己對某些事有相當的執著，但旁人卻無從得知',
    ],
  },
]
